app/views/folders/index.html.erb

SELECT COUNT(*) FROM "notes" WHERE "notes"."folder_id" = ?  [["folder_id", 1]]
---
      <div class="mr-auto p-2">
        <span class="badge badge-primary badge-pill"><%= folder.notes.size %></span>