app/controllers/folders_controller.rb

  def edit
    @folders = Folder.order('updated_at DESC')
    @folder = Folder.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if Folder.find(params[:id]).update(folder_params)
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]