app/controllers/folders_controller.rb

SELECT "folders".* FROM "folders"
---
  def index
    @folders = Folder.all

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @folder = Folder.find(params[:id])

INSERT INTO "folders" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2019-01-28 20:49:56.655334"], ["updated_at", "2019-01-28 20:49:56.655334"]]
---
  def create
    if Folder.create(folder_params)

SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "folders" SET "name" = ?, "updated_at" = ? WHERE "folders"."id" = ?  [["name", "first folder update"], ["updated_at", "2019-01-28 20:49:42.350086"], ["id", 1]]
---
  def update
    if Folder.find(params[:id]).update(folder_params)

DELETE FROM "folders" WHERE "folders"."id" = ?  [["id", 3]]
---
  def destroy
    if Folder.destroy(params[:id])

SELECT  "notes".* FROM "notes" WHERE "notes"."folder_id" = ? LIMIT ?  [["folder_id", 1], ["LIMIT", 1]]
---
  def get_notes
    @notes = Note.where(folder_id: params[:id])