app/controllers/notes_controller.rb

  def index
    @notes = Note.where(folder_id: params[:folder_id])
    @folder = Folder.find(params[:folder_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."folder_id" IS NULL
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def show
    @note = Note.find(params[:id])
    @folder = Folder.find(params[:folder_id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
    @folder = Folder.find(params[:folder_id])
    @note = Note.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def new
    @folder = Folder.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]

  def create
    @folder = Folder.find(params[:folder_id])
    if @folder.notes.create(note_params)
---
SELECT  "folders".* FROM "folders" WHERE "folders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "notes" ("title", "content", "created_at", "updated_at", "folder_id") VALUES (?, ?, ?, ?, ?)  [["title", "La bonne!"], ["content", "allez la!"], ["created_at", "2019-02-01 00:30:18.805835"], ["updated_at", "2019-02-01 00:30:18.805835"], ["folder_id", 2]]

  def update
    if Note.find(params[:id]).update(note_params)
---
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "nouvelle note 2"], ["updated_at", "2019-02-01 22:49:52.405783"], ["id", 21]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def destroy
    if Note.destroy(params[:id])
---
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]